In [20]:
import sqlite3
conn = sqlite3.connect("test10.db")
cur = conn.cursor()

In [3]:
c1 = """CREATE TABLE IF NOT EXISTS
Student(studentId INTEGER PRIMARY KEY NOT NULL, name TEXT NOT NULL, surname TEXT NOT NULL);"""
cur.execute(c1)

In [4]:
c2 = """CREATE TABLE IF NOT EXISTS
Subject(code TEXT NOT NULL, name TEXT PRIMARY KEY  NOT NULL, faculty_name TEXT, total_marks INTEGER NOT NULL);"""
cur.execute(c2)

In [5]:
cur.execute("INSERT INTO Student VALUES (6, 'Jishnu','Bandodkar')")
cur.execute("INSERT INTO Student VALUES (46, 'Mihir','Pandit')")
cur.execute("INSERT INTO Student VALUES (3, 'Aryan','Nanda')")
cur.execute("INSERT INTO Student VALUES (20, 'Tanay','Gada')")
cur.execute("INSERT INTO Student VALUES (9, 'Mohammed','Bhadsorawala')")
cur.execute("INSERT INTO Student VALUES (70, 'Varun','Sriram')")
cur.execute("INSERT INTO Student VALUES (73, 'Param','Thakkar')")
cur.execute("INSERT INTO Student VALUES (67, 'Anish','Singh')")
conn.commit()
print("Student Table created")

Student Table created

In [6]:
cur.execute("INSERT INTO Subject VALUES ('R4MA2007S', 'Linear Algebra', 'Sagar Rawool', 40)")
cur.execute("INSERT INTO Subject VALUES ('R4CO2001T', 'Discrete Mathematics and Applications', 'Sandip Shingade', 40)")
cur.execute("INSERT INTO Subject VALUES ('R4CO2002S', 'Digital Logic and Design', 'Varshapriya Jyotinagar', 40)")
cur.execute("INSERT INTO Subject VALUES ('R4CO2003T', 'Data Structures and Algorithms', 'Mansi Kulkarni', 40)")
cur.execute("INSERT INTO Subject VALUES ('R4CO2004S', 'Computer Organization and Architecture', 'Sachin Khedkar', 40)")
conn.commit()
print("Subject Table created")

Subject Table created

In [21]:
c3 = """CREATE TABLE IF NOT EXISTS
Marks(id INTEGER NOT NULL, subject TEXT NOT NULL, marks INTEGER,
CONSTRAINT fk_Student_studentId FOREIGN KEY (id) REFERENCES Student(studentId),
CONSTRAINT fk_Subject_name FOREIGN KEY (subject) REFERENCES Subject(name));"""
cur.execute(c3)

In [22]:
cur.execute("INSERT INTO Marks VALUES (6, 'Linear Algebra', 35)")
cur.execute("INSERT INTO Marks VALUES (6, 'Discrete Mathematics and Applications', 30)")
cur.execute("INSERT INTO Marks VALUES (6, 'Digital Logic and Design', 38)")
cur.execute("INSERT INTO Marks VALUES (6, 'Data Structures and Algorithms', 30)")
cur.execute("INSERT INTO Marks VALUES (6, 'Computer Organization and Architecture', 10)")
cur.execute("INSERT INTO Marks VALUES (46, 'Linear Algebra', 37)")
cur.execute("INSERT INTO Marks VALUES (46, 'Discrete Mathematics and Applications', 40)")
cur.execute("INSERT INTO Marks VALUES (46, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (46, 'Data Structures and Algorithms', 40)")
cur.execute("INSERT INTO Marks VALUES (46, 'Computer Organization and Architecture', 30)")
cur.execute("INSERT INTO Marks VALUES (3, 'Linear Algebra', 37)")
cur.execute("INSERT INTO Marks VALUES (3, 'Discrete Mathematics and Applications', 35)")
cur.execute("INSERT INTO Marks VALUES (3, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (3, 'Data Structures and Algorithms', 40)")
cur.execute("INSERT INTO Marks VALUES (3, 'Computer Organization and Architecture', 25)")
cur.execute("INSERT INTO Marks VALUES (20, 'Linear Algebra', 37)")
cur.execute("INSERT INTO Marks VALUES (20, 'Discrete Mathematics and Applications', 35)")
cur.execute("INSERT INTO Marks VALUES (20, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (20, 'Data Structures and Algorithms', 37)")
cur.execute("INSERT INTO Marks VALUES (20, 'Computer Organization and Architecture', 20)")
cur.execute("INSERT INTO Marks VALUES (9, 'Linear Algebra', 35)")
cur.execute("INSERT INTO Marks VALUES (9, 'Discrete Mathematics and Applications', 35)")
cur.execute("INSERT INTO Marks VALUES (9, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (9, 'Data Structures and Algorithms', 39)")
cur.execute("INSERT INTO Marks VALUES (9, 'Computer Organization and Architecture', 30)")
cur.execute("INSERT INTO Marks VALUES (70, 'Linear Algebra', 40)")
cur.execute("INSERT INTO Marks VALUES (70, 'Discrete Mathematics and Applications', 40)")
cur.execute("INSERT INTO Marks VALUES (70, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (70, 'Data Structures and Algorithms', 38)")
cur.execute("INSERT INTO Marks VALUES (70, 'Computer Organization and Architecture', 35)")
cur.execute("INSERT INTO Marks VALUES (73, 'Linear Algebra', 37)")
cur.execute("INSERT INTO Marks VALUES (73, 'Discrete Mathematics and Applications', 35)")
cur.execute("INSERT INTO Marks VALUES (73, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (73, 'Data Structures and Algorithms', 37)")
cur.execute("INSERT INTO Marks VALUES (73, 'Computer Organization and Architecture', 20)")
cur.execute("INSERT INTO Marks VALUES (67, 'Linear Algebra', 40)")
cur.execute("INSERT INTO Marks VALUES (67, 'Discrete Mathematics and Applications', 40)")
cur.execute("INSERT INTO Marks VALUES (67, 'Digital Logic and Design', 40)")
cur.execute("INSERT INTO Marks VALUES (67, 'Data Structures and Algorithms', 40)")
cur.execute("INSERT INTO Marks VALUES (67, 'Computer Organization and Architecture', 25)")
conn.commit()
print("Marks Table created")

Marks Table created

In [9]:
conn = sqlite3.connect("test9.db")
content = conn.execute('''SELECT * FROM Student''')
for row in content:
  print(row)

(3, 'Aryan', 'Nanda')
(6, 'Jishnu', 'Bandodkar')
(9, 'Mohammed', 'Bhadsorawala')
(20, 'Tanay', 'Gada')
(46, 'Mihir', 'Pandit')
(67, 'Anish', 'Singh')
(70, 'Varun', 'Sriram')
(73, 'Param', 'Thakkar')

In [10]:
cursor = conn.execute('''SELECT * FROM Subject''')
for row in cursor:
  print(row)

('R4MA2007S', 'Linear Algebra', 'Sagar Rawool', 40)
('R4CO2001T', 'Discrete Mathematics and Applications', 'Sandip Shingade', 40)
('R4CO2002S', 'Digital Logic and Design', 'Varshapriya Jyotinagar', 40)
('R4CO2003T', 'Data Structures and Algorithms', 'Mansi Kulkarni', 40)
('R4CO2004S', 'Computer Organization and Architecture', 'Sachin Khedkar', 40)

In [11]:
conn = sqlite3.connect("test9.db")
cur = conn.cursor()
desired_mark = 40
desired_subject = 'Data Structures and Algorithms'
query = '''
    SELECT Student.name
    FROM Student
    JOIN Marks ON Student.studentId = Marks.id
    JOIN Subject ON Marks.subject = Subject.name
    WHERE Marks.marks = ? AND Subject.name = ?
'''
cur.execute(query, (desired_mark, desired_subject))
rows = cur.fetchall()

if rows:
    print(f"Students who scored {desired_mark} in subject {desired_subject}:")
    for row in rows:
        print(row[0])
else:
    print("No students found with the specified criteria.")

Students who scored 40 in subject Data Structures and Algorithms:
Mihir
Aryan
Anish

In [12]:
conn = sqlite3.connect("test9.db")
cur = conn.cursor()
cur.execute('''
UPDATE Marks
SET marks = ?
WHERE id = ? AND subject = ?
''', (40, 73, 'Data Structures and Algorithms'))
conn.commit()

if cur.rowcount > 0:
    print("Row with id 73 updated successfully.")
else:
    print("No rows updated for id.")

conn.close()

Row with id 73 updated successfully.

In [16]:
conn = sqlite3.connect("test9.db")
cur = conn.cursor()
query = '''
  SELECT marks FROM Marks
  WHERE id in (73) AND subject in ('Data Structures and Algorithms');
'''
cur.execute(query)
row = cur.fetchone()

if row:
  print(int(row[0]))

else:
  print("No data found.")

conn.close()

40

In [17]:
conn = sqlite3.connect("test9.db")
cur = conn.cursor()
id = 20
subject = 'Computer Organization and Architecture'
query = '''
DELETE from Marks
WHERE id = ? AND subject = ?
'''
cur.execute(query, (id,subject))
conn.commit()

if cur.rowcount > 0:
    print(f"Row with id {id} and subject {subject} deleted successfully.")
else:
    print("No rows deleted.")

conn.close()

Row with id 20 and subject Computer Organization and Architecture deleted successfully.

In [23]:
conn = sqlite3.connect("test10.db")
cur = conn.cursor()
id = 9
subject = 'Computer Organization and Architecture'
query = '''
UPDATE Marks
SET marks = NULL
WHERE id = ? AND subject = ?
'''
cur.execute(query, (id,subject))
conn.commit()

if cur.rowcount > 0:
    print(f"Marks with id {id} and subject {subject} deleted successfully.")
else:
    print("Nothing deleted.")

conn.close()

Marks with id 9 and subject Computer Organization and Architecture deleted successfully.